Veldmonster/contiki-mirror/cpu/arm/lm3s9b96/watchdog.c
/*
 * Copyright (c) 2011, Universal Concepts CC, South Africa
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the Institute nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * This file is part of the Contiki operating system.
 * This port targets the Stellaris ARM, Cortex M3, LM3S9xxxx
 * which is based on siskin's, multiple-netif branch
 * for the AVR Zigbit and Microchips ENC28J60.
 * @(#)$
 */

/*
 *  Filename: watchdog.c
 *  Created on: 06 Jan 2012
 *  Author: Anton Veldhuizen
 */

/* MAP_Watchdog routines for the LM3S9B96 */

/* The default timeout of 2 seconds works on most MCUs.
 * It should be disabled during sleep (unless used for wakeup) since
 * it draws significant current (~5 uamp on 1284p, 20x the MCU consumption).
 */

#ifndef WATCHDOG_ENABLED
#define WATCHDOG_ENABLED 1
#endif

#include "lm3s9b96inc.h"

#include <driverlib/watchdog.h>
#include <driverlib/interrupt.h>

#include "dev/watchdog.h"
/*---------------------------------------------------------------------------*/
void
IsrWatchdog(void)
{
  MAP_WatchdogIntClear(WATCHDOG0_BASE);
}

void
watchdog_init(void)
{
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_WDOG0);
  delay_us(5);
	/*
	 * Check to see if the registers are locked, and if so, unlock them.
	 * Locking prevents stray access from modifying register content
	 */
	if(MAP_WatchdogLockState(WATCHDOG0_BASE) == true)
	{
		MAP_WatchdogUnlock(WATCHDOG0_BASE);
	}
  MAP_IntEnable(INT_WATCHDOG);

  /* Prevent watchdog reset during debugging */
  MAP_WatchdogStallEnable(WATCHDOG0_BASE);
  /* 2 seconds */
	MAP_WatchdogReloadSet(WATCHDOG0_BASE, (MAP_SysCtlClockGet() * 2));
	MAP_WatchdogResetEnable(WATCHDOG0_BASE);
}
/*---------------------------------------------------------------------------*/
void
watchdog_start(void)
{
#if WATCHDOG_ENABLED == 1
		/* Start the watchdog */
		MAP_WatchdogEnable(WATCHDOG0_BASE);
		/* Prevent unwanted watchdog register changes */
		MAP_WatchdogLock(WATCHDOG0_BASE);
#endif  
}
/*---------------------------------------------------------------------------*/
void
watchdog_periodic(void)
{
#if WATCHDOG_ENABLED == 1
  MAP_WatchdogIntClear(WATCHDOG0_BASE);
#endif
}
/*---------------------------------------------------------------------------*/
void
watchdog_stop(void)
{
#if WATCHDOG_ENABLED == 1
	MAP_WatchdogResetDisable(WATCHDOG0_BASE);
#endif
}
/*---------------------------------------------------------------------------*/
void
watchdog_reboot(void)
{
#if WATCHDOG_ENABLED == 1
	watchdog_start();
	if(MAP_WatchdogLockState(WATCHDOG0_BASE) == true)
	{
		MAP_WatchdogUnlock(WATCHDOG0_BASE);
	}
	MAP_WatchdogReloadSet(WATCHDOG0_BASE, (MAP_SysCtlClockGet() / 4)); // 250ms
	while(1); //loop
#endif
}
/*---------------------------------------------------------------------------*/
